[
    {
        "title": "Leadership Update at Engineers Without Borders Canada", 
        "datePublished": "January 21, 2025",
        "description": "For more than two decades, Engineers Without Borders Canada has empowered leaders, fostered innovation, and supported systemic change to build a more equitable and sustainable world.", 
        "filePath": "news/leadership-photo.png",
        "link": "https://www.ewb.ca/en/news-and-events/news/leadership-update-at-engineers-without-borders-canada/"

    }, 
    {
        "title": "Celebrating International Volunteer Day with Engineers Without Borders Canada", 
        "datePublished": "December 4, 2024",
        "description": "This International Volunteer Day, we celebrate the impactful work of Engineers Without Borders Canada (EWB). With over 32 university chapters and 8 professional chapters across the country, EWB empowers a network of passionate volunteers to address the root causes of poverty and inequity worldwide.", 
        "filePath": "news/volunteer-day.png",
        "link": "https://www.ewb.ca/en/news-and-events/news/celebrating-international-volunteer-day-with-engineers-without-borders-canada/"
    },
    {
        "title": "Chapter Spotlight: How UofT EWB is Engineering Change in Toronto", 
        "datePublished": "September 27, 2024",
        "description": "With a new school year just around the corner, many of our 20+ EWB academic chapters across Canada have started their recruitment processes. Located at the heart of Ontario, our University of Toronto chapter is busy with recruitment, setting up projects, and preparing for xChange 2024!", 
        "filePath": "news/uoft-spotlight.png",
        "link": "https://www.ewb.ca/en/news-and-events/news/chapter-spotlight-how-uoft-ewb-is-engineering-change-in-toronto/"
    },
    {
        "title": "Chapter Spotlight: How EWB UPEI is Engineering Change in Prince Edward Island", 
        "datePublished": "August 22, 2024",
        "description": "With a new school year just around the corner, many of our 20+ EWB academic chapters across Canada have started their recruitment processes. Our University of Prince Edward Island (UPEI) chapter has already hit the ground running, and is working hard, creating impactful changes within the community.", 
        "filePath": "news/upei-spotlight.png",
        "link": "https://www.ewb.ca/en/news-and-events/news/chapter-spotlight-how-ewb-upei-is-engineering-change-in-prince-edward-island/"
    },
    {
        "title": "Your Questions Answered: Engineering Brighter Tomorrows", 
        "datePublished": "August 1, 2024",
        "description": "Engineering Brighter Tomorrows (EBT) addresses the needs of educational and healthcare facilities in Zambia and Malawi through tailored solar energy solutions and digital inclusion. On June 27th, 2024, we held a webinar about how strategic solar energy projects can drive systemic change in the region and create lasting impacts in underserved communities. Here are some of the unanswered questions from the event.", 
        "filePath": "news/brighter-tomorrows.png",
        "link": "https://www.ewb.ca/en/news-and-events/news/your-questions-answered-engineering-brighter-tomorrows/"
    }
]